# =========================== BOT CONNECTION ===========================

token = '1258620743:AAH0ilCQPFZGVd31nMVduAavSAzyqiTSgVQ'

proxy_list = [
    '49.12.4.194:40878',
    '96.113.176.101:1080',
    '49.12.33.219:1080',
    '82.223.120.213:1080',
    '96.96.33.133:1080',
    '216.144.230.233:15993',
    '96.44.133.110:58690',
    '212.129.25.23:30166',
    '198.12.154.22:15687',
    '139.99.104.233:4883',
    '198.12.157.28:62615',
    '92.223.93.212:1080',
    '178.170.168.212:1080',
    '104.248.63.49:30588'
]

# =========================== DATABASE SETTINGS ===========================

DATABASE = 'isso'
USER = 'issohost'
PASSWORD = 'ws3iysiw'
HOST = '127.0.0.1'

# ================================= MESSAGES =================================


def hello(name):
    return f"Привет {name}, меня зовут Евгений и я программа-аналитик рынка транспортного " \
           f"строительства. Для продолжения работы выбери один из пунктов меню: "


menu = f"1) Чтобы получить общую статистику по ИССО введите команду /report \n" \
       f"2) Для получения 'ТОП 20' по регионам России введите команду /russia \n" \
       f"2) Для получения 'ТОП 10' списка балансодержателей ИССО введите /customers \n"
